/**
 * アイコン関連のユーティリティクラス
 */
export class IconUtils {
  /**
   * ランダムなアイコンを取得する
   * @returns {string} 絵文字アイコン
   */
  static getRandomIcon() {
    const icons = [
      '📗', '📕', '📘', '📚', '📙', '📖', '🗒', '📄', '✍️', '📝',
      '🌱', '🌲', '🌴', '🍁', '🍜', '🍇', '🍑', '🍎', '🍊', '🍆',
      '🍠', '🍄', '🥒', '🥕', '🐰', '🐓', '🐣', '🐈', '🐞', '🐛',
      '🚀', '🛴', '✈️', '🚗', '🚤', '🍖', '🍢', '🍣', '🍔', '🌞',
      '🌀', '🏃‍♂️', '🎾', '🏊‍♀️', '⛳️', '🏐', '🏄‍♀️', '🏀', '🏓',
      '🏸', '⚽️', '🦍', '🐴', '🐼', '🐻‍❄️',
    ];
    const index = this._getRandomNum(0, icons.length - 1);
    return icons[index];
  }

  /**
   * 指定範囲のランダムな整数を取得する
   * @param {number} min - 最小値
   * @param {number} max - 最大値
   * @returns {number}
   * @private
   */
  static _getRandomNum(min, max) {
    return Math.floor(Math.random() * (max + 1 - min)) + min;
  }
}
